#+TITLE: BEET
#+SETUPFILE: /home/wilk/git-repositories/org-html-themes/setup/theme-readtheorg-local.setup
#+LANGUAGE: fr
#+begin_src emacs-lisp :exports none
  (setq org-export-in-background t)
  (setq org-publish-project-alist
             '(("Beets-data"
                 :base-directory "/srv/multimedia/musique/ADMINISTRATION/"
                 :base-extension "org"
                 :publishing-directory "/ftp:j.cubizolles@ftpperso.free.fr:"
                 :publishing-function org-html-publish-to-html
                 :headline-levels 3
                 :section-numbers nil
                 :with-toc t
                 )
                 ("css"
                 :base-directory "~/git-repositories/org-html-themes/"
                 ;; :base-extension "css"
                 :publishing-directory "/ftp:mpsi2llg@ftpperso.free.fr:styles/"
                 :publishing-function org-publish-attachment
                 ;; :exclude "PrivatePage.org"   ;; regexp
                 :headline-levels 3
                 :section-numbers nil
                 :with-toc t
                 ;; :html-head "<link rel=\"stylesheet\"
                 ;;         href=\"../other/mystyle.css\" type=\"text/css\"/>"
                 ;; :html-preamble t
                 )
                ("website" :components ("Beets-data"))))
#+end_src

#+RESULTS:
| Beets-data | :base-directory | /srv/multimedia/musique/ADMINISTRATION/ | :base-extension       | org                                    | :publishing-directory | /ftp:j.cubizolles@ftpperso.free.fr: | :publishing-function | org-html-publish-to-html | :headline-levels |   3 | :section-numbers | nil | :with-toc | t |
| css        | :base-directory | ~/git-repositories/org-html-themes/     | :publishing-directory | /ftp:mpsi2llg@ftpperso.free.fr:styles/ | :publishing-function  | org-publish-attachment              | :headline-levels     |                        3 | :section-numbers | nil | :with-toc        | t   |           |   |
| website    | :components     | (Beets-data)                            |                       |                                        |                       |                                     |                      |                          |                  |     |                  |     |           |   |

